app/views/house_expense_templates/_form.html.erb

    <%= f.label :recurring_frequency_id %><br>
    <%= f.collection_select(:recurring_frequency_id, RecurringFrequency.all, :id, :frequency) %>
---
SELECT "recurring_frequencies".* FROM "recurring_frequencies"