app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)

    respond_to do |format|
      if @house.save
---
INSERT INTO "houses" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["address", "test"], ["created_at", "2015-09-18 19:25:54.814776"], ["updated_at", "2015-09-18 19:25:54.814776"]]

  def update
    respond_to do |format|
      if @house.update(house_params)
---
UPDATE "houses" SET "name" = $1, "address" = $2, "updated_at" = $3 WHERE "houses"."id" = $4  [["name", "206C, Compassvale Lane"], ["address", "206C, Compassvale Lane"], ["updated_at", "2015-09-27 04:29:01.473998"], ["id", 1]]