app/controllers/house_expense_templates_controller.rb

  def index
    @house_expense_templates = HouseExpenseTemplate.all
---
SELECT "house_expense_templates".* FROM "house_expense_templates"

  def create
    @house_expense_template = HouseExpenseTemplate.new(house_expense_template_params)
    @house_expense_template.house_id = current_user.house_id
    respond_to do |format|
      if @house_expense_template.save
---
INSERT INTO "house_expense_templates" ("expense_name", "recurring_frequency_id", "is_mandatory", "default_amount", "effective_from", "effective_to", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_house_expense_template
      @house_expense_template = HouseExpenseTemplate.find(params[:id])
---
SELECT  "house_expense_templates".* FROM "house_expense_templates" WHERE "house_expense_templates"."id" = $1 LIMIT 1  [["id", 1]]