app/controllers/house_expenses_controller.rb

SELECT  "house_account_cycles".* FROM "house_account_cycles" WHERE (id = (select to_number(setting_value,'9') from house_settings where setting_name = 'ACCOUNT_CYCLE') and house_id = 1)  ORDER BY "house_account_cycles"."id" ASC LIMIT 1
SELECT "house_expense_templates".* FROM "house_expense_templates" WHERE "house_expense_templates"."house_id" = $1  [["house_id", 1]]
SELECT  "house_expenses".* FROM "house_expenses" WHERE "house_expenses"."house_id" = $1 LIMIT 1  [["house_id", 1]]
---
  def index
    @current_account_cycle = HouseAccountCycle.where("id = (select to_number(setting_value,'9') from house_settings where setting_name = 'ACCOUNT_CYCLE') and house_id = ?", current_user.house_id).first
    @fixed_expenses = HouseExpenseTemplate.where(:house_id => current_user.house_id)
    @house_expenses = HouseExpense.where(:house_id => current_user.house_id)

SELECT "tenants".* FROM "tenants" WHERE "tenants"."house_id" = $1  [["house_id", 1]]
---
  def new
    @house_expense = HouseExpense.new
    @house_expense.tenant_id = current_user.id
    @tenants = Tenant.where(:house_id => current_user.house_id)

INSERT INTO "house_expense_per_tenants" ("tenant_id", "amount", "house_expense_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tenant_id", 1], ["amount", "15.3"], ["house_expense_id", 7], ["created_at", "2015-09-28 16:18:34.412702"], ["updated_at", "2015-09-28 16:18:34.412702"]]
INSERT INTO "house_expenses" ("expense_name", "amount", "spent_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["expense_name", "Shopping"], ["amount", "20.0"], ["spent_date", "2015-09-27"], ["created_at", "2015-09-27 15:57:57.451822"], ["updated_at", "2015-09-27 15:57:57.451822"]]
---
  def create
    @house_expense = HouseExpense.new(house_expense_params)
    @house_expense.house_expense_per_tenant.each do |per_tenant|
      per_tenant.amount = @house_expense.amount / @house_expense.house_expense_per_tenant.size
    end
    @house_expense.house_id = current_user.house_id
    @house_expense.house_account_cycle_id = HouseSetting.where("setting_name = ? and house_id = ?", "ACCOUNT_CYCLE", current_user.house_id)
    respond_to do |format|
      if @house_expense.save

DELETE FROM "house_expenses" WHERE "house_expenses"."id" = $1  [["id", 2]]
---
  def destroy
    @house_expense.destroy

SELECT  "house_expenses".* FROM "house_expenses" WHERE "house_expenses"."id" = $1 LIMIT 1  [["id", nil]]
---
    def set_house_expense
      @house_expense = HouseExpense.find(params[:id])