app/controllers/house_settings_controller.rb

  def index
    @house_settings = HouseSetting.all
---
SELECT "house_settings".* FROM "house_settings"

  def create
    @house_setting = HouseSetting.new(house_setting_params)

    respond_to do |format|
      if @house_setting.save
---
INSERT INTO "house_settings" ("house_id", "setting_name", "setting_value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["house_id", 1], ["setting_name", "ACCOUNT_CYCLE"], ["setting_value", "1"], ["created_at", "2015-09-27 13:46:26.562301"], ["updated_at", "2015-09-27 13:46:26.562301"]]

    def set_house_setting
      @house_setting = HouseSetting.find(params[:id])
---
SELECT  "house_settings".* FROM "house_settings" WHERE "house_settings"."id" = $1 LIMIT 1  [["id", 1]]