app/controllers/house_account_cycles_controller.rb

  def index
    @house_account_cycles = HouseAccountCycle.all
---
SELECT "house_account_cycles".* FROM "house_account_cycles"

  def create
    @house_account_cycle = HouseAccountCycle.new(house_account_cycle_params)

    respond_to do |format|
      if @house_account_cycle.save
---
INSERT INTO "house_account_cycles" ("house_id", "from_date", "to_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["house_id", 1], ["from_date", "2015-08-25"], ["to_date", "2015-09-25"], ["created_at", "2015-09-27 13:37:31.269412"], ["updated_at", "2015-09-27 13:37:31.269412"]]

    def set_house_account_cycle
      @house_account_cycle = HouseAccountCycle.find(params[:id])
---
SELECT  "house_account_cycles".* FROM "house_account_cycles" WHERE "house_account_cycles"."id" = $1 LIMIT 1  [["id", 1]]