app/controllers/recurring_frequencies_controller.rb

  def index
    @recurring_frequencies = RecurringFrequency.all
---
SELECT "recurring_frequencies".* FROM "recurring_frequencies"

  def create
    @recurring_frequency = RecurringFrequency.new(recurring_frequency_params)

    respond_to do |format|
      if @recurring_frequency.save
---
INSERT INTO "recurring_frequencies" ("frequency", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["frequency", "Monthly"], ["description", "Monthly"], ["created_at", "2015-09-27 11:03:33.995059"], ["updated_at", "2015-09-27 11:03:33.995059"]]

    def set_recurring_frequency
      @recurring_frequency = RecurringFrequency.find(params[:id])
---
SELECT  "recurring_frequencies".* FROM "recurring_frequencies" WHERE "recurring_frequencies"."id" = $1 LIMIT 1  [["id", 4]]