app/controllers/tenants_controller.rb

SELECT "tenants".* FROM "tenants"
---
  def index
    @tenants = Tenant.all

INSERT INTO "tenants" ("house_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["house_id", 1], ["name", "test"], ["created_at", "2015-09-18 19:26:12.212546"], ["updated_at", "2015-09-18 19:26:12.212546"]]
---
  def create
    @tenant = Tenant.new(tenant_params)

    respond_to do |format|
      if @tenant.save

UPDATE "tenants" SET "name" = $1, "updated_at" = $2 WHERE "tenants"."id" = $3  [["name", "Mayuran"], ["updated_at", "2015-09-27 04:29:48.025015"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tenant.update(tenant_params)

DELETE FROM "tenants" WHERE "tenants"."id" = $1  [["id", 2]]
---
  def destroy
    @tenant.destroy

SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_tenant
      @tenant = Tenant.find(params[:id])